src/DataProcessors/инкВыгрузкаНачисленийЗарплатыВБухгалтерию/инкВыгрузкаНачисленийЗарплатыВБухгалтерию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>инкВыгрузкаНачисленийЗарплатыВБухгалтерию</name>
  <attributes>
    <name>ПериодВыгрузки</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/DataProcessors/инкВыгрузкаНачисленийЗарплатыВБухгалтерию/Forms/Форма/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыЗапуска = инкОбщийКлиент.ПолучитьПараметрыЗапуска();	
	
	ВыполнитьАвтоматическуюВыгрузку = Ложь;
	Если ПараметрыЗапуска <> Неопределено Тогда
		
		Если инкОбщийКлиентСервер.ЕстьСвойство(ПараметрыЗапуска,"ВидПараметра") Тогда
			
			Если ПараметрыЗапуска.ВидПараметра = "ВыгрузкаИзЗИКВБП" Тогда
				ВыполнитьАвтоматическуюВыгрузку = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВыполнитьАвтоматическуюВыгрузку Тогда
		
		ВыполнитьАвтоматическуюВыгрузкуДанных(ПараметрыЗапуска);
		ЗавершитьРаботуСистемы(Ложь);
		
	Иначе
		
	    Объект.ПериодВыгрузки.ДатаНачала    = НачалоГода(ТекущаяДата());
	    Объект.ПериодВыгрузки.ДатаОкончания = КонецГода(ТекущаяДата());
		
	КонецЕсли;	
		
КонецПроцедуры   

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьАвтоматическуюВыгрузкуДанных(ПараметрыЗапуска)
	
	Объект.ПериодВыгрузки.ДатаНачала    = ПараметрыЗапуска.Дата1;
	Объект.ПериодВыгрузки.ДатаОкончания = ПараметрыЗапуска.Дата2;
	
	ФайлВыгрузкиАдрес = ВыгрузитьДанныеНаСервере();
    
    Если ФайлВыгрузкиАдрес = Неопределено Тогда
    	Возврат;
	КонецЕсли;     
	
	ФайлХМЛ = ПолучитьИзВременногоХранилища(ФайлВыгрузкиАдрес);
	
	Если ФайлХМЛ <> Неопределено Тогда
		
		Попытка
			
			ИмяФайла = "Выгрузка_ЗИК_БП.xml";
			ФайлХМЛ.Записать(ПараметрыЗапуска.ПутьККаталогуВыгрузки + "\" + ИмяФайла);
			
		Исключение
		    ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка при сохранении ХМЛ файла. Описание ошибки: " + ОписаниеОшибки());
		КонецПопытки;  
		
	КонецЕсли;

КонецПроцедуры

#Область о // Обычная выгрузка данных:

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	
	КлючеваяОперация = "Обработка.инкВыгрузкаНачисленийЗарплатыВБухгалтерию.ВыгрузкаДанных";
	ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	
    ФайлВыгрузкиАдрес = ВыгрузитьДанныеНаСервере();
    
    Если ФайлВыгрузкиАдрес = Неопределено Тогда
    	Возврат;
    КонецЕсли;                                          

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ФайлВыгрузкиАдрес",ФайлВыгрузкиАдрес);
	ДополнительныеПараметры.Вставить("ИмяФайла","Выгрузка начислений из ЗИК 11.0 в БП 3.0 .xml");
	ДополнительныеПараметры.Вставить("ВидКлиента");
	
	#Если ВебКлиент Тогда     
		
		ДополнительныеПараметры.ВидКлиента = "ВебКлиент";	
		
		списокКнопокВопроса = новый СписокЗначений();
		списокКнопокВопроса.Добавить("Сохранить","Сохранить");
		списокКнопокВопроса.Добавить("Отмена","Отмена");
		
		Оповещение = новый ОписаниеОповещения("СохранитьФайлЗавершение",ЭтотОбъект,ДополнительныеПараметры);
	  	ПоказатьВопрос(Оповещение,"Выберите действие",списокКнопокВопроса,30,"Сохранить","Сохранить файл выгрузки?","Отмена");

	#Иначе	
		
		ДополнительныеПараметры.ВидКлиента = "";	

		// Выбор файла для открытия:	
		Режим = РежимДиалогаВыбораФайла.Сохранение;
		Диалог = Новый ДиалогВыбораФайла(Режим);
		Диалог.ПолноеИмяФайла = ДополнительныеПараметры.ИмяФайла;
		
		ОбратныйВызов = Новый ОписаниеОповещения("СохранитьФайлЗавершение", ЭтотОбъект, ДополнительныеПараметры); 
		// Открывает диалоговое окно:
		Диалог.Показать(ОбратныйВызов);
		
	#КонецЕсли       

КонецПроцедуры
   
&НаКлиенте
Процедура СохранитьФайлЗавершение(РезультатВопроса,ДополнительныеПараметры) экспорт
	
	Если РезультатВопроса = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ФайлВыгрузкиАдрес = ДополнительныеПараметры.ФайлВыгрузкиАдрес;
	Если ДополнительныеПараметры.ВидКлиента = "ВебКлиент" Тогда

		Если РезультатВопроса = "Сохранить" тогда
			НачатьПолучениеФайлаССервера(ФайлВыгрузкиАдрес,ДополнительныеПараметры.ИмяФайла);
		Иначе
			Возврат;
		КонецЕсли;		

	Иначе                              
		ПутьКФайлу = РезультатВопроса[0];
		НачатьПолучениеФайлаССервера(,ФайлВыгрузкиАдрес, ПутьКФайлу);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьДанныеНаСервере()
	
	МенеджерОбработки = РеквизитФормыВЗначение("Объект");
    АдресФайла =  МенеджерОбработки.ВыгрузитьДанныеВФайлНаСервере();
    
    Возврат АдресФайла;    
    
КонецФункции

#КонецОбласти

#КонецОбласти
